# ShouldWaitForLockAvailability Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ICentralLockedCallback..::..ShouldWaitForLockAvailability Method
ICentralLockedCallback Interface See Also
---
Returns whether Revit should wait and try again to acquire the lock on central.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
bool ShouldWaitForLockAvailability()
```

Visual Basic
---
```text
Function ShouldWaitForLockAvailability As Boolean
```

Visual C++
---
```text
bool ShouldWaitForLockAvailability()
```

# ### Return Value
True means wait and try again later. False means immediately give up.
# See Also
ICentralLockedCallback Interface
Autodesk.Revit.DB Namespace